ensemble-learning/test_cases/squareDuct/nnfoam_inputs/foam_base/0.orig/k.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
2500
(
0.00123015
0.00133332
0.00156459
0.00191719
0.00237196
0.00290563
0.00349531
0.00412095
...
)
;

boundaryField
{
    bottomWall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
50
(
0.00123015
0.00133332
0.00156459
0.00191719
0.00237196
0.00290563
0.00349531
0.00412095
...
)
;
    }
    leftWall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
50
(
0.00123015
0.00133332
0.00156459
0.00191719
0.00237196
0.00290563
0.00349531
0.00412095
...
)
;
    }
    topSym
    {
        type            symmetryPlane;
    }
    rightSym
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
